{
  "title": "Healthcare CMO Summit 2025: Driving Innovation in Healthcare Leadership",
  "url": "https://www.pm360online.com/healthcare-cmo-summit-2025-driving-innovation-in-healthcare-leadership/",
  "date": "2025-09-03T18:11:16+00:00",
  "author": "Sydney Yankowicz",
  "feed": "PM360",
  "tags": "Industry",
  "cover_image": "https://www.pm360online.com/wp-content/uploads/2025/08/HC-CMO-Sept-Summit-2025-H2-02-300x300.jpg",
  "content": "<p><img src="https://www.pm360online.com/wp-content/uploads/2025/08/HC-CMO-Sept-Summit-2025-H2-02-300x300.jpg" alt="" width="279" height="279">The Healthcare CMO Summit 2025 is set to take place on September 11-12, 2025, at the luxurious Park Hyatt Aviara Resort in San Diego, California. This exclusive, invitation-only summit brings together Chief Medical Officers (CMOs) and innovative healthcare solution providers to discuss pressing clinical challenges and marketdevelopments.</p> 
<p>The summit will feature a distinguished lineup of speakers, including:</p> 
<ul> 
<li><strong>Lisa Laurent</strong>, Chief Medical Officer, Providence Saint Joseph Medical Center</li> 
<li><strong>Sonal Chandratre</strong>, Chief Medical Officer, Ascension Health</li> 
<li><strong>Anand Nayee</strong>, VP Chief Medical Officer, BayCare Hospital Wesley Chapel and St. Joseph’s Hospital-North, BayCare Health System</li> 
<li><strong>Steven Brass</strong>, Executive Vice President – Chief Medical Executive, Harris Health System</li> 
<li><strong>Salim Saiyed</strong>, Vice President, Chief Health Informatics Officer, Trinity Health</li> 
</ul> 
<p>As healthcare continues to evolve, the Healthcare CMO Summit aims to equip leaders with the knowledge and tools necessary to navigate this dynamic landscape. Attendees will have the opportunity to engage in meaningful discussions, share insights, and collaborate on innovative solutions to enhance patient care and operational efficiency.</p> 
<p><strong>What to Expect – Participants can look forward to:</strong></p> 
<ul> 
<li><span style="text-decoration:underline;">Panel Discussions:</span> Engaging conversations with industry leaders on current healthcare challenges and solutions.</li> 
<li><span style="text-decoration:underline;">Compelling Presentations:</span> Insights from expert speakers on innovative strategies and best practices.</li> 
<li><span style="text-decoration:underline;">Informal Networking Opportunities:</span> Connect with peers over lunch, coffee breaks, and dinners, fostering valuable relationships.</li> 
<li><span style="text-decoration:underline;">Exclusive Pre-scheduled One-on-One Meetings:</span> Tailored interactions to discuss specific challenges and opportunities with industry experts.</li> 
</ul> 
<p>This summit aims to foster strategic partnerships and provide actionable insights to enhance healthcare leadership.</p> 
<p>Registration is limited to invitees only. For more information and to request an invitation, please visit the <a href="https://www.sept25.nhcmo.marcusevans-summits.com/?utm_source=PM360&amp;utm_medium=PR&amp;utm_campaign=PR">official website</a> or contact Anna Iacovou at annai@marcusevanscy.com.</p> 
<p><strong>About marcus evans</strong><br> 
marcus evans is a global media and corporate marketing company known for organizing high-quality business events that foster innovation and collaboration across various industries.</p>"
}